Autodesk.Revit.DB.CloudPath.IsValidName(System.String)
A valid name contains at most getMaximumLengthForNames() characters and
does not contain any invalid characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.CloudPath.#ctor(System.Guid,System.String,System.Guid,System.String)
Constructs a CloudPath which represents a specified central model
in a specified cloud project.
projectId:
The GUID of the cloud project which contains the model.
projectName:
The name of the cloud project which contains the model.
modelId:
The GUID of the cloud .rvt model.
modelName:
The name of the cloud .rvt model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.CloudPath
This class represents a location in the cloud, rather than a
location on disk, network drive or a Revit Server location.
Remarks:
CloudPaths must refer to Revit models.
Since:
2019